---
kind: method
id: M:Autodesk.Revit.DB.BoundarySegment.GetCurve
source: html/db394580-81c3-a25e-2562-707deefcd0e0.htm
---
# Autodesk.Revit.DB.BoundarySegment.GetCurve Method

Get a copy of the curve that is formed along this boundary.

## Syntax (C#)
```csharp
public Curve GetCurve()
```

## Returns
A copy of the curve.